//todo GLOBAL TASKS   
// Настроить или заменить плагин рейтинг, чтобы считал дроби //todo ВЫПОЛНЕНО   

/*заменить прокрутку описания элемента в списках на фикс. 
высоту с обрезанием текста, а на странице одного элемента
показывать полное описание */




//___ задачи на 26.05.24   
// запрос на profile-favorite                                //todo ВЫПОЛНЕНО  
// запрос на profile-rewiews                                 //todo ВЫПОЛНЕНО   


//___на 31.05.24   
// раскидать сердечки                                        //todo ВЫПОЛНЕНО  
// добавление в избранные                                    //todo ВЫПОЛНЕНО  
// удфление из избранных                                     //todo ВЫПОЛНЕНО  

//___на 01.06.24   
// загрузка пива, точек и пивоварен                          //todo ВЫПОЛНЕНО  
// загрузка рекламных блоков                                 //todo ВЫПОЛНЕНО  
// добавить подгрузку контента по кнопке "показать еще"      //todo ВЫПОЛНЕНО   

// ___на 03.06.24   
// настроить поиск                                           //todo ВЫПОЛНЕНО  

//___на 06.06.24    
// настроить форму редактирования профиля                   //todo ВЫПОЛНЕНО   
// настроить смену аватара                                  //todo ВЫПОЛНЕНО   

//___на 07.06.24    
// настроить da-data-suggestions                            //todo ВЫПОЛНЕНО   

//___на 12.06.24    
/* настроить маршруты на страницу одного                    //todo ВЫПОЛНЕНО    
элемента со страниц списков элементов*/ 

/* настроить маршруты на страницу одного
элемента из рекламных блоков */                             //todo Выполнено    

// ___на 13.06.24   
/* настроить рендер одного элемента
при переходе из общего списка мест*/                        //todo ВЫПОЛНЕНО    

/* настроить рендер одного элемента
при переходе из общего списка пива*/                        //todo ВЫПОЛНЕНО    

/* настроить рендер одного элемента
при переходе из общего списка пивоварни*/

/* исправить некорректное удаление аватара*/ 