//todo GLOBAL TASKS   
// Настроить или заменить плагин рейтинг, чтобы считал дроби //todo ВЫПОЛНЕНО   


//___ задачи на 26.05.24   
// запрос на profile-favorite                                //todo ВЫПОЛНЕНО  
// запрос на profile-rewiews                                 //todo ВЫПОЛНЕНО   


//___на 31.05.24   
// раскидать сердечки                                        //todo ВЫПОЛНЕНО  
// добавление в избранные                                    //todo ВЫПОЛНЕНО  
// удфление из избранных                                     //todo ВЫПОЛНЕНО  

//___на 01.06.24   
// загрузка пива, точек и пивоварен                          //todo ВЫПОЛНЕНО  
// загрузка рекламных блоков                                 //todo ВЫПОЛНЕНО  
// добавить подгрузку контента по кнопке "показать еще"      //todo ВЫПОЛНЕНО   

// ___на 03.06.24   
// настроить поиск                                           //todo ВЫПОЛНЕНО  

//___на 06.06.24    
// настроить форму редактирования профиля                   //todo ВЫПОЛНЕНО   
// настроить смену аватара                                  //todo ВЫПОЛНЕНО   